package com.example.a86_radiobutton1

class Characteristic {
    val excellent = "\nВы демонстрируете глубокие и всесторонние знания по широкому спектру исторических тематик. " +
            "У вас отличное понимание ключевых событий, их причин и последствий, а также умение анализировать и " +
            "интерпретировать исторические источники. Вы способны проводить параллели между различными эпохами, " +
            "делая обоснованные выводы и представления о значении истории для современности.\n"
    val good = "\nВы обладаете хорошими знаниями о значимых событиях и периодах. Может уверенно обсуждать основные " +
            "достижения и ошибки различных цивилизаций, знаете множество дат и имен. Ваш анализ исторических событий " +
            "имеет логичную структуру, хотя иногда встречаются незначительные пробелы в знаниях.\n"
    val satisfactory = "\nУ вас есть базовые знания о важных исторических событиях и личностях. Вы может назвать " +
            "ключевые даты и факты, однако ваше понимание взаимосвязей и глубины событий ограничено. Иногда вы " +
            "сталкиваетесь с трудностями в объяснении сложных понятий, но демонстрируете желание учиться и улучшать " +
            "свои знания через дополнительные исследования и изучение литературы.\n"
    val unsatisfactory = "\nВы имеете некоторые поверхностные знания о самых известных событиях, однако ваше восприятие " +
            "истории не всегда точно. Вы можете путать даты и факты. Часто вы не может корректно обсудить более сложные " +
            "темы и проявляете нехватку интереса к углубленному изучению.\n"
    val bad = "\nВы имеет серьезные проблемы с пониманием элементарных исторических фактов и контекстов. Ваши знания " +
            "очень ограничены, вы с трудом отвечает на базовые вопросы и не в состоянии объяснить даже самые известные " +
            "события. Не проявляете интереса к изучению истории и не предпринимаете попыток улучшить свои знания.\n"
}